IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280013x_flash_ecc_regs.xml
<module id="FLASH_ECC_REGS" HW_revision="" description="FLASH ECC Registers">
	<register id="ECC_ENABLE" width="32" page="1" offset="0x0" internal="0" description="ECC Enable">
		<bitfield id="ENABLE" description="Enable ECC" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="FECC_CTRL" width="32" page="1" offset="0x20" internal="0" description="ECC Control">
		<bitfield id="ECC_TEST_EN" description="Enable ECC Test Logic" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
</module>
